___

<a href='https://www.schoolofds.com'><center><img src='../schoolofds_logo.png'/></center></a>
___
<center><em>Content Copyright by School of Data Science #schoolofds</em></center>

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed(101)

In [ ]:
df = pd.DataFrame()

In [3]:
?pd.DataFrame

In [17]:
x = 'iit, Powai                 -----> Mumbai'

x.split(',')

['iit', ' Powai                 -----> Mumbai']

In [43]:
df = pd.DataFrame(randn(5,4),columns='W X Y Z'.split())

In [44]:
df.shape

(5, 4)

In [45]:
df

          W         X         Y         Z
0 -0.993263  0.196800 -1.136645  0.000366
1  1.025984 -0.156598 -0.031579  0.649826
2  2.154846 -0.610259 -0.755325 -0.346419
3  0.147027 -0.479448  0.558769  1.024810
4 -0.925874  1.862864 -1.133817  0.610478

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [21]:
df['War']
df.War

0    0.302665
1   -0.134841
2    0.807706
3   -0.497104
4   -0.116773
Name: War, dtype: float64

In [22]:
# Pass a list of column names
df2 = df[['War','Zar']]
df2

        War       Zar
0  0.302665 -1.159119
1 -0.134841  0.184502
2  0.807706  0.329646
3 -0.497104  0.484752
4 -0.116773  1.996652

In [23]:
# SQL Syntax (NOT RECOMMENDED!)
df.War

0    0.302665
1   -0.134841
2    0.807706
3   -0.497104
4   -0.116773
Name: War, dtype: float64

DataFrame Columns are just Series

In [24]:
type(df['War'])

pandas.core.series.Series

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   War     5 non-null      float64
 1   Xar     5 non-null      float64
 2   Yar     5 non-null      float64
 3   Zar     5 non-null      float64
dtypes: float64(4)
memory usage: 288.0 bytes

**Creating a new column:**

In [46]:
df['new'] = df['W'] + df['Y']

In [47]:
df

          W         X         Y         Z       new
0 -0.993263  0.196800 -1.136645  0.000366 -2.129908
1  1.025984 -0.156598 -0.031579  0.649826  0.994405
2  2.154846 -0.610259 -0.755325 -0.346419  1.399521
3  0.147027 -0.479448  0.558769  1.024810  0.705796
4 -0.925874  1.862864 -1.133817  0.610478 -2.059691

** Removing Columns**

In [48]:
df.drop(['new','Z'],axis=1)

          W         X         Y
0 -0.993263  0.196800 -1.136645
1  1.025984 -0.156598 -0.031579
2  2.154846 -0.610259 -0.755325
3  0.147027 -0.479448  0.558769
4 -0.925874  1.862864 -1.133817

In [49]:
df

          W         X         Y         Z       new
0 -0.993263  0.196800 -1.136645  0.000366 -2.129908
1  1.025984 -0.156598 -0.031579  0.649826  0.994405
2  2.154846 -0.610259 -0.755325 -0.346419  1.399521
3  0.147027 -0.479448  0.558769  1.024810  0.705796
4 -0.925874  1.862864 -1.133817  0.610478 -2.059691

In [50]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
0 -0.993263  0.196800 -1.136645  0.000366 -2.129908
1  1.025984 -0.156598 -0.031579  0.649826  0.994405
2  2.154846 -0.610259 -0.755325 -0.346419  1.399521
3  0.147027 -0.479448  0.558769  1.024810  0.705796
4 -0.925874  1.862864 -1.133817  0.610478 -2.059691

In [51]:
df.drop(['new','Z'],axis=1,inplace=True)

In [52]:
df['ZZ'] = ['A','B','C','D','E']

In [59]:

df = df.set_index(['ZZ'])

In [60]:
df

           W         X         Y
ZZ
A  -0.993263  0.196800 -1.136645
B   1.025984 -0.156598 -0.031579
C   2.154846 -0.610259 -0.755325
D   0.147027 -0.479448  0.558769
E  -0.925874  1.862864 -1.133817

Can also drop rows this way:

In [35]:
df.drop(4,axis=0)

        War       Xar       Yar
0  0.302665  1.693723 -1.706086
1 -0.134841  0.390528  0.166905
2  0.807706  0.072960  0.638787
3 -0.497104 -0.754070 -0.943406

** Selecting Rows**

In [39]:
df.loc[1]

War   -0.134841
Xar    0.390528
Yar    0.166905
Name: 1, dtype: float64

Or select based off of position instead of label

In [40]:
df.iloc[2]

War    0.807706
Xar    0.072960
Yar    0.638787
Name: 2, dtype: float64

** Selecting subset of rows and columns **

In [62]:
df

           W         X         Y
ZZ
A  -0.993263  0.196800 -1.136645
B   1.025984 -0.156598 -0.031579
C   2.154846 -0.610259 -0.755325
D   0.147027 -0.479448  0.558769
E  -0.925874  1.862864 -1.133817

In [61]:
df.loc['B']

W    1.025984
X   -0.156598
Y   -0.031579
Name: B, dtype: float64

In [63]:
df.loc[['A','B'],['W','Y']]

           W         Y
ZZ
A  -0.993263 -1.136645
B   1.025984 -0.031579

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [64]:
df

           W         X         Y
ZZ
A  -0.993263  0.196800 -1.136645
B   1.025984 -0.156598 -0.031579
C   2.154846 -0.610259 -0.755325
D   0.147027 -0.479448  0.558769
E  -0.925874  1.862864 -1.133817

In [65]:
df>0

        W      X      Y
ZZ
A   False   True  False
B    True  False  False
C    True  False  False
D    True  False   True
E   False   True  False

In [66]:
df[df>0]

           W         X         Y
ZZ
A        NaN  0.196800       NaN
B   1.025984       NaN       NaN
C   2.154846       NaN       NaN
D   0.147027       NaN  0.558769
E        NaN  1.862864       NaN

In [69]:
df[df['W']>0]

           W         X         Y
ZZ
B   1.025984 -0.156598 -0.031579
C   2.154846 -0.610259 -0.755325
D   0.147027 -0.479448  0.558769

In [72]:
df[df['W']>0]['Y']

ZZ
B   -0.031579
C   -0.755325
D    0.558769
Name: Y, dtype: float64

In [207]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

For two conditions you can use | and & with parenthesis:

In [75]:
df[(df['W']>0) & (df['Y'] > 0)]

           W         X         Y
ZZ
D   0.147027 -0.479448  0.558769

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [209]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [210]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [211]:
newind = 'CA NY WY OR CO'.split()

In [212]:
df['States'] = newind

In [213]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [214]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [215]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [216]:
df.set_index('States',inplace=True)

In [79]:
df2 = pd.DataFrame(randn(1,4),columns='W X Y rohit'.split())
df2

          W         X        Y     rohit
0  0.681209  1.035125 -0.03116  1.939932

In [77]:
df['rohit'] = 999
df

           W         X         Y  rohit
ZZ
A  -0.993263  0.196800 -1.136645    999
B   1.025984 -0.156598 -0.031579    999
C   2.154846 -0.610259 -0.755325    999
D   0.147027 -0.479448  0.558769    999
E  -0.925874  1.862864 -1.133817    999

In [82]:
df.shape

(5, 4)

In [87]:
df.loc[len(df.index)] = ['iit',89,93,10]
df

           W          X          Y  rohit
ZZ
A  -0.993263   0.196800  -1.136645    999
B    1.02598  -0.156598  -0.031579    999
C    2.15485  -0.610259  -0.755325    999
D   0.147027  -0.479448   0.558769    999
E  -0.925874   1.862864  -1.133817    999
5     rohit2  89.000000  93.000000     10
6        iit  89.000000  93.000000     10

In [89]:
df.to_excel('03-Data.xlsx')

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [253]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [254]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [257]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.153661  0.167638
   2 -0.765930  0.962299
   3  0.902826 -0.537909
G2 1 -1.549671  0.435253
   2  1.259904 -0.447898
   3  0.266207  0.412580

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [260]:
df.loc['G1']

          A         B
1  0.153661  0.167638
2 -0.765930  0.962299
3  0.902826 -0.537909

In [263]:
df.loc['G1'].loc[1]

A    0.153661
B    0.167638
Name: 1, dtype: float64

In [265]:
df.index.names

FrozenList([None, None])

In [266]:
df.index.names = ['Group','Num']

In [267]:
df

                  A         B
Group Num
G1    1    0.153661  0.167638
      2   -0.765930  0.962299
      3    0.902826 -0.537909
G2    1   -1.549671  0.435253
      2    1.259904 -0.447898
      3    0.266207  0.412580

In [270]:
df.xs('G1')

            A         B
Num
1    0.153661  0.167638
2   -0.765930  0.962299
3    0.902826 -0.537909

In [271]:
df.xs(['G1',1])

A    0.153661
B    0.167638
Name: (G1, 1), dtype: float64

In [273]:
df.xs(1,level='Num')

              A         B
Group
G1     0.153661  0.167638
G2    -1.549671  0.435253

In [37]:
df['category'] = ['iitb','iitk','iitc','iitd','iitr']

In [40]:
pd.get_dummies(df)

,W,X,Y,Z,category_iitb,category_iitc,category_iitd,category_iitk,category_iitr
0,0.302665,1.693723,-1.706086,-1.159119,1,0,0,0,0
1,-0.134841,0.390528,0.166905,0.184502,0,0,0,1,0
2,0.807706,0.072960,0.638787,0.329646,0,1,0,0,0
3,-0.497104,-0.754070,-0.943406,0.484752,0,0,1,0,0
4,-0.116773,1.901755,0.238127,1.996652,0,0,0,0,1

In [41]:
df

          W         X         Y         Z category
0  0.302665  1.693723 -1.706086 -1.159119     iitb
1 -0.134841  0.390528  0.166905  0.184502     iitk
2  0.807706  0.072960  0.638787  0.329646     iitc
3 -0.497104 -0.754070 -0.943406  0.484752     iitd
4 -0.116773  1.901755  0.238127  1.996652     iitr

# Great Job!